a = 5 == 5
# true
# იმიტომ იქნება true რომ ხუთი უნდრის ხუთს
print(a) 

b = 10 != 20
# true
# იმიტომრომ 10 არ არის 20 ის ტოლი
print(b)

c = 4 > 3 and 2 < 5
# true 
# იმიტომრომ ორივე მოქმედება სწორად შესრულდება
print(c)

d = 10 > 20 or 5 < 8
# true
#  როდესაც or არის მოქმედება გამოყენებული და ერთერთი არის true მაშინ მოქმედებაც იქნება true
print(d)

e = not (7 > 3)
# false
#  7 არის 3 ზე მეტი მაგრამ not არღვევსს მოქმედებას და იქნება არასწორი false 
print(e)

f = "hello" == "world"
# false
# hello  არ უდრის world ს 
print(f)

g = 15 >= 10
# true
# იმიტომრომ 15 მეტია 10 ზე ან თანაბარია
print(g)

h = 8 <= 8
# true 
# მართალია რადგან 8 = 8
print(h)

i = 3 > 1 and 2 == 2 and 4 != 5
# true
# მართალია რადგან ყველა მოქმედება სწორად სრულდება
print(i)

j = not (10 < 5 or 2 == 2)
# false
# არასწორია რადგან not უდგას წინ 
print(j)