# 1) მომხმარებელს შემოატანინეთ სიტყვა. ტერმინალში კი დაბეჭდეთ ეს სიტყვა ისე რომ იყოს:

# 1. ყველა პატარა ასო;
# 2. ყველა დიდი ასო;
# 3. პირველი ასო დიდი, ხოლო ყველა დანარჩენი პატარა.

word = input("Please enter some word: ")

print(word.lower())
print(word.upper())
print(word.capitalize())

# 2) მომხმარებელს შემოატანინეთ სამი წინადადება და თითოეულზე გამოიყენეთ სხვადასხვა სტრინგის მეთოდი:
# პირველ წინადადებაზე — .lower()
# მეორე წინადადებაზე — .upper()
# მესამე წინადადებაზე — .capitalize()

str1 = input("Please enter the proposal: ")
str2 = input("Please enter the proposal: ")
str3 = input("Please enter the proposal: ")

print(str1.lower())
print(str2.upper())
print(str3.capitalize())

# 3) ცვლადში შეინახე შენი სახელი. მომხმარებელს შეეკითხე თავისი სახელი, იმ შემთხვევაში თუ თქვენი სახელები ემთხვევა დაბეჭდეთ "Our names are similar!", თუ არ ემთხვევა დაბეჭდეთ "We have different names". გაითვალისწინეთ, რომ მომხმარებელმა შეიძლება თქვენნაირი სახელი შემოიტანოს, თუმცა სახელის ასოები შესაძლოა იყოს სხვადასხვა შრიფტის ზომით, ამიტომ ამან თქვენ პროგრამაში შეფერხება არ უნდა გამოიწვიოს (გამოიყენეთ ნასწავლი სტრინგის მეთოდები)

user_name = input("Please enter your name: ")

if user_name.lower() == "saba":
    print("Our names are similar!")
else:
    print("We have different names")


# 4) ცვლადში შეინახე წინადადება, დაწერე ისეთი პროგრამა რომ მხოლოდ წინადადების პირველი სიტყვა იყოს დიდი ასოთი, დანარჩენი კი იყოს პატარა.

str1 = input("Please enter the proposal: ")
print(str1.capitalize())

# 5) კომენტარის სახით ჩამოწერეთ ყველა სტრინგის მეთოდი, რომელიც ისწავლეთ. თითოეულს მიუწერეთ დეტალური განმარტება და მათზე მოიყვანეთ თითო-თითო მაგალითი.

# .lower() - ფუნქცია, რომელიც იღებს სთრინგს და აბრუნებს ახალ სთრინგს პატარა ასოებით
# .upper() - ფუნქცია, რომელიც იღებს სთრინგს და აბრუნებს ახალ სთრინგს დიდი ასოებით
# .capitalize() - ფუნქცია, რომელიც იღებს სთრინგს და აბრუნებს ახალ სთრინგს, სადაც პირველი ასო არის მხოლოდ დიდი, დანარჩენი კი პატარა.