# 1)შექმენით ფუქნცია, რომელსაც გადაეცემა მომხმარებლის გვარი და შეამოწმეთ, თუ ეს გვარი იწყება "g" ასოთი, მაშინ დააბრუნეთ True, სხვა შემთხვევაში False.
def starts_with_g(surname):
    return surname.startswith('g')
# 2)შექმენით ფუნქცია, რომელსაც გადაეცემა დადებითი რიცხვი, შეამოწმეთ თუ ეს რიცხვი უარყოფითია დააბრუნეთ დადებითად, თუ დადებითია დააბრუნეთ უარყოფითად.
def invert_sign(number):
    if number < 0:
        return abs(number)  # თუ რიცხვი უარყოფითია, დააბრუნე დადებითი
    else:
        return -number  

# 3)შექმენით ფუნქცია რომელსაც გადაეცემა ერთი წილადი რიცხვი და ერთი მთელი რიცხვი, შემდეგ დააბრუნეთ ეს წილადი რიცხვი დამრგვალებული გადმოცემულ მთელი რიცხვის ნაწილამდე (სიტყვაზე გადმოგვეცა 5.32174 და 2, უნდა დააბრუნოთ 5.32).
def round_decimal(number, digits):
    return round(number, digits)


# 4)შექმენით ფუნქცია, რომელსაც გადაეცემა ერთი სტრინგი, თქვენი დავალებაა დაასორტიროთ (დაალაგოთ) ეს სტრინგი და დააბრუნოთ ისევ სტრინგის სახით.
def sort_string(text):#
    return ''.join(sorted(text))

# 5)შექმენით ფუნქცია, რომელსაც გადაეცემა ერთი სია და ერთი რაღაც სიმბოლო, საბოლოოდ დააბრუნეთ ამ სიის ელემენტები, გადმოცემული სიმბოლოთი შეერთებული (გამოიყენეთ .join()).
def join_with_symbol(lst, symbol):
    str_elements = [str(item) for item in lst]
    return symbol.join(str_elements)
# 6)მომხმარებელს შემოატანინეთ წინადადება და ეს წინადადება გაყავით სფეისების ადგილას.
def split_sentence():
    sentence = input("შეიყვანეთ წინადადება: ")
    words = sentence.split()
    print(words)







































