# 1
# iteration - იტერაცია(გამეორება)
# იქამდე შეგვეკითხება პაროლს ,სანამ სწორადა არ ჩავწერთ.
# ერთი და იგივე მუსიკა ჩაირთო რამდენჯერმე.

# selection - გადაწყვეტილება ან ქმედება რომელიც აირჩევა კონკრეტულ პირობაზე დაყრდნობით
# სმარტ საათები როცა ზომავენ ადამიანის გულის ცემას ,თუ გადააჭარბებს დაშვებულ ნორმას ის გაუგზავნის შეტყობინებას.თუ არ გადააჭარბა არ გაუგზავნის.

# sequence - თანმიმდევრობა
# ერთი ვიდეოს შემდეგ დაიწყება მეორე,მეორის შემდეგ მესამე და ასე შემდეგ...



#2
a = 7 == 7
# true
# იმიტომ იქნება true რომ შვიდი უდრის შვიდს


b = 20 != 30
# true
# იმიტომრომ 20 არ არის 30 ის ტოლი


c = 5 > 4 and 3 < 6
# true 
# იმიტომ რომ ორივე მოქმედება სწორად შესრულდება

d = 11 > 21 or 6 < 9
# true
#  როდესაც or არის მოქმედება გამოყენებული და ერთერთი არის true მაშინ მოქმედებაც იქნება true


e = not (8 > 4)
# false
#  8 არის 4 ზე მეტი მაგრამ not არღვევსს მოქმედებას და იქნება არასწორი false 

g = 25 >= 20
# true
# იმიტომ რომ 25 მეტია 20 ზე ან თანაბარია


h = 8 <= 8
# true 
# მართალია, რადგან 8 = 8


i = 5 > 3 and 2 == 2 and 4 != 5
# true
# მართალია რადგან ყველა მოქმედება სწორად სრულდება


j = not (10 < 5 or 2 == 2)
# false
# არასწორია რადგან not უდგას წინ 


k = 9 > 4  and  5 < 9
# true
# იმიტომ,რომ ორივე მოქმედება სწორად სრულდება



# 3

name=input("saba: ")
age=int(input("10: "))
tall=int(input("1.47sm: "))


print(age > 18)
print(name = "saba: ")
print(tall > 1.80)



#4
#Flowchart - ფოტოს მეშვეობით ალგორითმის ასახვა

#Pseudocode - ალგორითმის ასახვა ინგლისურით + პროგრამირების ენით

#Natural Language - ალგორითმის გამოსახვა ბუნებრივი ენით



#5

# დავალების შესასრულებლად  ნაბიჯ-ნაბიჯ დაწერილ ინსტრუქციას ალგორითმი ეწოდება.

# ალგორითმის მაგალითია: ნამცხვრის გამოცხობა. ჩურჩხელის გაკეთება. ღვინის დამზადება.
