# 1) შექმენით რიცხვების სია, სადაც შენახული გექნებათ 10 რიცხვი. Slicing-ის მეშვეობით გამოიტანეთ ამ სიის პირველი ხუთი რიცხვი და გამოიტანეთ ტერმინალში

#           0   1   2   3    4    5   6   7   8  9
numbers = [25, 30, 15, 20, 1002, 77, 56, 71, 10, 2]

print(numbers[0:5])

# 2) შექმენით სია, სადაც შეინახავთ რიცხვებს 20-იდან 30-ის ჩათვლით. Slicing-ის გამოყენებით დაბეჭდეთ ამ სიიდან  ყველა ლუწი რიცხვი. (მინიშნება: step)
#           0   1   2   3   4   5   6   7   8   9  10
numbers = [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]

print(numbers[0::2])

# 3) ცვლადში შეინახეთ სიტყვა "Goal-Oriented Academy".
# გამოიყენეთ Slicing რათა აქედან დაბეჭდოთ მხოლოდ სიტყვა "Academy"

string1 = "Goal-Oriented Academy"

print(string1[-7:])

# 5) კომენტარის სახით ახსენით თუ რა უპირატესობები აქვს ფუნქციების გამოყენებას Python-ში.

# ფუნქციები გვაძლევს იმის საშუალებას, რომ შევასრულოთ კონკრეტული დავალებები მათი გამოძახებით, ისე რომ ჩვენი ხელით არ მოგვიწიოს მათი შექმნა.
# ასევე ფუნქციები არის მრავალჯერ გამოძახებადი, რაც იმას ნიშნავს, რომ მათი გამოყენება შეგვიძლია იმდენჯერ, რამდენჯერაც დაგვჭირდება